---
kind: type
id: T:Autodesk.Revit.DB.Analysis.FieldDomainPointsByUV
source: html/aa1eb974-d283-f16e-8431-a7e02fe4e076.htm
---
# Autodesk.Revit.DB.Analysis.FieldDomainPointsByUV

Represents a set of two-dimensional point coordinates (defined usually on surface)

## Syntax (C#)
```csharp
public class FieldDomainPointsByUV : FieldDomainPoints
```